 [
                {
                    "id": 1, 
                    "title": "Software Developer 4", 
                    "locationID": 3, 
                    "companyID": 2, 
                    "languageID": 1, 
                    "skillsetID": 5, 
                    "description": "Design, configure, and implement our data systems and stream processing pipelines/nCode analytics jobs, web services, and other components/nWork with operations to build and configure maintainable, resource-efficient systems/nWork with data pipelines using Kafka, Cassandra, Spark/nLeverage Event processing technologies to deliver real time analytics features/nDevelop a cloud service that would be processing billions of events a day/nLeverage fast data pipelines for real time analytics on various Oracle SaaS applications/nContribute ideas for continually improving the team's productivity, job enjoyment, and code quality./nActively mentor junior developers to develop their technical expertise/nHave fun engineering software and scalable systems", 
                    "link": "https://oracle.taleo.net/careersection/2/jobdetail.ftl?job=90953"
                },
                {
                    "id": 2, 
                    "title": "Software Developer 2", 
                    "locationID": 3, 
                    "companyID": 2, 
                    "languageID": 1, 
                    "skillsetID": 4, 
                    "description": "Are you interested in building Identity infrastructure for the cloud? Oracle’s Cloud Infrastructure team is building new Infrastructure-as-a-Service technologies that operate at high scale in a broadly distributed multi-tenant cloud environment. Our customers run their businesses on our cloud, and our mission is to provide them with best in class compute, storage, networking, database, security, and an ever expanding set of foundational cloud-based services./n/nWe’re looking for Software Developer with expertise and passion in solving difficult problems in distributed systems, virtualized infrastructure, and highly available services. If this is you, at Oracle you can design and build innovative new systems from the ground up. These are exciting times in our space - we are growing fast, still at an early stage, functioning like a startup and working on ambitious new initiatives. An engineer at any level can have significant technical and business impact./n/nAs a Software Developer, you will own and lead software architecture and development for Authentication and Authorization components of Oracle’s Cloud Identity Infrastructure.  You should be a distributed systems generalist, able to build broad systems interactions, while being very hands-on, able to dive deep into any part of the stack and lower level system interactions. You should value simplicity and scale, work comfortably in a collaborative, agile environment, and be excited to learn.", 
                    "link": "https://oracle.taleo.net/careersection/2/jobdetail.ftl?job=86141"
                },
                {
                    "id": 3, 
                    "title": "Software Developer 5", 
                    "locationID": 2, 
                    "companyID": 2, 
                    "languageID": 2, 
                    "skillsetID": 6, 
                    "description": "Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc./n/nAs a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. Define specifications for significant new projects and specify, design and develop software according to those specifications. You will perform professional software development tasks associated with the developing, designing and debugging of software applications or operating systems./n/nProvide leadership and expertise in the development of new products/services/processes, frequently operating at the leading edge of technology. Recommends and justifies major changes to existing products/services/processes. BS or MS degree or equivalent experience relevant to functional area. 8 more years of software engineering or related experience." ,                  
                    "link": "https://oracle.taleo.net/careersection/2/jobdetail.ftl?job=60564"
                },
                {
                    "id": 4, 
                    "title": "Software Developer 3", 
                    "locationID": 1, 
                    "companyID": 2, 
                    "languageID": 1, 
                    "skillsetID": 1, 
                    "description": "Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc./n/nAs a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs./n/nDuties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience." ,                  
                    "link": "https://oracle.taleo.net/careersection/2/jobdetail.ftl?job=46894"
                },
                {
                    "id": 5, 
                    "title": "Application Developer, Corporate Asset Management Engineering", 
                    "locationID": 5, 
                    "companyID": 1, 
                    "languageID": 4, 
                    "skillsetID": 4, 
                    "description": "Build custom front-ends (web and mobile), back-end services, and third-party integrations to automate business processes./nPropose, design, and implement business workflows to streamline asset management lifecycles./nMaintain strong development practices including technical design and writing clean, modular, well tested and self-sustaining code./nCollaborate with business analysts, program managers, end users and other internal teams to translate business requirements into technical solutions that work at Google scale./nIntegrate third-party products with Google’s internal systems as well as support and upgrade implemented systems." ,                  
                    "link": "https://www.google.com/about/careers/search?src=Online/Job+Board/indeed&utm_source=indeed&utm_medium=jobaggr&utm_campaign=freeaggr#!t=jo&jid=94815001"
                },
                {
                    "id": 6, 
                    "title": "Systems Engineer, Site Reliability Engineering", 
                    "locationID": 4, 
                    "companyID": 1, 
                    "languageID": 2, 
                    "skillsetID": 3, 
                    "description": "Design, write and deliver software to improve the availability, scalability, latency, and efficiency of Google's services./nSolve problems relating to mission critical services and build automation to prevent problem recurrence; with the goal of automating response to all non-exceptional service conditions./nInfluence and create new designs, architectures, standards and methods for large-scale distributed systems./nEngage in service capacity planning and demand forecasting, software performance analysis and system tuning./nConduct periodic on call duties using a follow-the-sun model." ,                  
                    "link": "https://www.google.com/about/careers/search?src=Online/Job+Board/indeed&utm_source=indeed&utm_medium=jobaggr&utm_campaign=freeaggr#!t=jo&jid=83835001"
                },
                {
                    "id": 7, 
                    "title": "Software Development Engineer", 
                    "locationID": 2, 
                    "companyID": 3, 
                    "languageID": 1, 
                    "skillsetID": 1, 
                    "description": "* Design, develop, test, troubleshoot, debug, deploy, maintain, document and deliver large-scale, highly distributed, real-time and management systems that are core to effectively managing the supply chain business./n/n* Use Java, object-oriented (OO) design patterns, distributed Oracle databases, and data modeling techniques./n/n* Gather and analyze business and functional requirements, and translate business requirements into technical design specifications./n/n* Serve as a key technical resource in the full development cycle./n/n* Produce comprehensive, usable software documentation./n/n* Recommend changes in development, maintenance and system standards./n/n* Work in an agile development environment, where you are always working on the most important stuff./n/n* Hire, coach, and mentor individuals." ,                  
                    "link": "https://en-amazon.icims.com/jobs/219381/software-development-engineer/job?mode=job&iis=Indeed&iisn=Indeed+%28Free+Posting%29&mobile=false&width=884&height=1200&bga=true&needsRedirect=false"
                },
                {
                    "id": 8, 
                    "title": "Senior Software Engineer", 
                    "locationID": 1, 
                    "companyID": 3, 
                    "languageID": 2, 
                    "skillsetID": 6, 
                    "description": "Prime Now is Amazon's newest benefit for Prime members offering one-hour delivery on tens of thousands of items through a new application. Our software accounts for a massive amount of constantly changing variables. We optimize route generation for every item, enabling customers to receive delivery in an hour or less, avoiding a trip to the store. /nWe are looking for a talented Sr. Software Engineer to design and build these new systems. The software will need to process thousands of transactions per second across massive data sets. This team handles real-time transportation constraints (weather, traffic and more), optimizes routing algorithms and utilizes machine learning. Are you up to this challenge?/nYou will work on a V1 product and have the autonomy to deliver! " ,                  
                    "link": "https://oracle.taleo.net/careersection/2/jobdetail.ftl?job=86141"
                },
                {
                    "id": 9, 
                    "title": "Software Development Engineer - Mobile Demand Platform ( ios, Android)", 
                    "locationID": 2, 
                    "companyID": 3, 
                    "languageID": 1, 
                    "skillsetID": 2, 
                    "description": "Do you want to help developers monetize and advertise their apps across mobile phones and tablets?/n/nWe are looking for a software development engineer to build back-end services for the next generation Mobile Advertising Demand platform. This platform will extend frictionless advertising capabilities for digital and physical goods enabling our customers promote goods through a seamless experience. You will drive innovation on a number of technologies across campaign and image optimization techniques. You will work on a distributed system leveraging AWS that would manage campaigns to meet service level goals. This is a unique opportunity to learn about the advertising supply/demand dynamics and build software solutions to manage delivery of advertising budgets. You will work with partner teams that display ads across all mobile platforms e.g. iOS, Android, HTML5 as well as other advertising exchanges. As a key team member, you will own major deliverables through all aspects of the development cycle: scoping, design, implementation, testing on solutions delivered./n/nYou thrive in a start-up like environment where flexibility, teamwork, and delivering rock solid, customer focused solutions on short timelines is paramount. You enjoy working on complex system software, tackling tough challenges, and feel strongly not only about building good software but about making that software achieve its goals in operational reality. You show a strong sense of ownership, bias for action, agility, creativity, and ingenuity./n/nJoin our team and deliver game changing mobile advertising solutions that engage our customers." ,                  
                    "link": "https://en-amazon.icims.com/jobs/261541/software-development-engineer---mobile-demand-platform-%28-ios%2c-android%29/job?mode=job&iis=Indeed&iisn=Indeed+%28Free+Posting%29"
                },
                {
                    "id": 10, 
                    "title": "Applications Developer 2", 
                    "locationID": 1, 
                    "companyID": 2, 
                    "languageID": 1, 
                    "skillsetID": 1, 
                    "description": "Oracle America, Inc. has Applications Developer positions available in Austin, TX. Analyze, design, develop, troubleshoot and debug Oracle Retail Stores Applications. Perform detailed design based on provided high level architecture and design specification.andnbsp; Implement enhancements to the Oracle Retail Stores Applications. Write and execute unit tests.andnbsp; Build SQL queries and assist in system planning, scheduling and implementation. Review integration and regression test plans created by QA and interact with QA and Product Management about problems in the code./nEmployer will accept Master’s degree in Computer Science, Computer Engineering, or related technical field. Education or experience must include: 1. Object oriented languages, including Java, Objective C, C/C++; 2. UML and Design Patterns; 3. Designing and implementing new modulesandnbsp; using technologies, including webservices and JEE; 4. Writing SQL queries for Oracle and other databases using SQL and stored procedures; 5. Maintaining and creating new unit tests; 6. Understanding and complying with software development methodologies and processes; 7. Troubleshooting Application Servers deployment issues and security; 8. Mobile application design and development; and, 9. Eclipse and Netbeans or other IDE. Experience may be gained concurrently." ,                  
                    "link": "https://oracle.taleo.net/careersection/2/jobdetail.ftl?job=87689"
                },
                {
                    "id": 11, 
                    "title": "Software Engineer, Oculus", 
                    "locationID": 2, 
                    "companyID": 4, 
                    "languageID": 2, 
                    "skillsetID": 3, 
                    "description": "As a software engineer at Oculus Research your job is to figure out what virtual reality looks like 5 years in the future. You'll be part of a multi-disciplinary team pushing on every aspect of the experience: haptics, audio, input, computer vision, optics, display technology, and whatever else we can dream up. Our mission is to keep advancing the VR platform; the work you do here will lay the foundation for VR experiences for years to come. Ideal candidates are exceptional C/C++ programmers who are comfortable working with new technologies at multiple levels in the software stack. We’re looking for adaptable coders who are used to owning and writing non-trivial software systems.", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0IA000000G46DiMAJ"
                },
                {
                    "id": 12, 
                    "title": "Partner Engineer, Platform", 
                    "locationID": 5, 
                    "companyID": 4, 
                    "languageID": 1, 
                    "skillsetID": 4, 
                    "description": "Partner Engineering is a highly technical team that works with our strategic partners to integrate Facebook and Instagram Platforms into their Web sites, applications, and devices. In this role, you will engage with some of the world's most influential companies and work closely with our world-class engineering and product teams. The ideal candidate will combine excellent technical and business skills to make our partners successful and improve the Facebook and Instagram Platforms. This position is based in our New York office.", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0IA000000G3uvoMAB"
                },
                {
                    "id": 13, 
                    "title": "Software Engineer, Systems", 
                    "locationID": 5, 
                    "companyID": 4, 
                    "languageID": 2, 
                    "skillsetID": 3, 
                    "description": "We’re looking for hardcore infrastructure engineers to join the Systems Engineering team. This infrastructure team builds the large, distributed systems that are the heart of Facebook, no easy task. Our code serves millions of requests per second, and it does so with sub-second latency and in a fault tolerant manner. We handle everything from distributed data storage, to synchronization and coordination of large server farms, to building a fast PHP virtual machine for our front end Facebook code. We are looking for candidates who posses a demonstrable, radiant energy towards tackling complexity and building platforms that can scale through multiple orders of magnitude to make the world more open and connected.", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0IA0000006cQPOMA2"
                },
                {
                    "id": 14, 
                    "title": "Software Engineer, Search & Machine Learning", 
                    "locationID": 5, 
                    "companyID": 4, 
                    "languageID": 4, 
                    "skillsetID": 6, 
                    "description": "We’re looking for data-driven engineers to join the Search and Machine Learning team. As a part of the larger Entities team, which is working to map and connect the high-quality social and entity graph on Facebook, the Search team is focused on building the best location dataset in the world for our location products (mobile Nearby, Graph Search, etc.) and 3rd party developers. The work is a mix of Crowdsourcing (PHP/front-end), Machine Learning (Python/ranking), and Search Features/Ranking (Python/ranking). We are looking for candidates who share a passion for tackling complexity and making sense out of massive datasets using text retrieval, NLP, machine learning and various other optimization techniques.", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0IA0000006cPbyMAE"
                },
                {
                    "id": 15, 
                    "title": "Software Engineer, Products", 
                    "locationID": 5, 
                    "companyID": 4, 
                    "languageID": 4, 
                    "skillsetID": 4, 
                    "description": "Want to create products that more than 1 billion people around the world use? Want to build new features and improve existing products like Photos, Video, Places, NewsFeed, Search, Mobile and Messaging? Want to solve unique, large scale, highly complex technical problems? Facebook is seeking an experienced Software Engineer to join the Products team. You can help build the next-generation systems behind Facebook's products, create web applications that reach millions of people, build high volume servers and be a part of a team that’s working to help people connect with each other around the globe. Join us! This position is full-time and is based in our New York office. ", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0IA0000006cPKxMAM"
                },
                {
                    "id": 16, 
                    "title": "Solutions Engineer", 
                    "locationID": 5, 
                    "companyID": 4, 
                    "languageID": 1, 
                    "skillsetID": 3, 
                    "description": "Our team is at the intersection of software engineering and digital advertising. This role is for engineers who love to build products and work with partners to realize the full potential of those products. As a Solutions Engineer, you are the engineering lead of your assigned set of partners and are responsible for developing their Facebook technology strategy and executing on it. You will spend 50% of your time working with product engineering teams and writing code. The other 50% you will spend working directly with partners. This is an engineering role with a high bar for problem solving and coding skills. This role is located in our New York, NY office.", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0I1200000G4LyeEAF"
                },
                {
                    "id": 17, 
                    "title": "Software Engineer, Android", 
                    "locationID": 5, 
                    "companyID": 4, 
                    "languageID": 1, 
                    "skillsetID": 2, 
                    "description": "We are looking for someone that has strong experience developing user interfaces for applications on Android using Android SDK. If you are interested in joining a world-class team of passionate people and industry veterans who like to work hard and play hard, we look forward to hearing from you soon!", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0IA000000CvZ0LMAV"
                },
                {
                    "id": 18, 
                    "title": "Client Solutions Manager, Tech/Telco (NYC)", 
                    "locationID": 5, 
                    "companyID": 4, 
                    "languageID": 4, 
                    "skillsetID": 6, 
                    "description": "The Client Solutions Manager for Facebook’s Global Marketing Solutions team is a strategic and enthusiastic solution-driver who puts our customers at the core of everything we do. This is an outstanding opportunity to build and manage key relationships, be a platform and product expert, and become an expert in media planning, strategy and measurement to our Fortune 500, multi-channel advertisers. With proven understanding of both online and traditional media, this role is responsible for partnering with the sales team to develop industry-specific relationships, drive revenue by negotiating and optimizing complex opportunities, and use data and analytics to build a consultative solution for our customers. The Client Solutions Manager will establish and strengthen key client relationships with a focus on driving revenue, advertiser education & advertiser satisfaction. Success in this position requires strong consultative sales, analytical, and technical skills, a focus on client service, and the ability to thrive in a dynamic, team-focused environment delivering against tight deadlines. This position is based in our NYC office.", 
                    "link": "https://www.facebook.com/careers/department?dept=sales&req=a0I1200000G4WKMEA3"
                },
                {
                    "id": 19, 
                    "title": "Release Engineer", 
                    "locationID": 5, 
                    "companyID": 4, 
                    "languageID": 4, 
                    "skillsetID": 3, 
                    "description": "Release Engineering plays an integral role in implementing and executing product release processes. The role supports Facebook's engineering by managing the source code management system, automating builds and regression testing, building tools and monitoring used in software deployments, and coordinating and pushing new releases to the production infrastructure. The Release Engineering team ensures that new software is released in a streamlined manner from development to production. The team establishes procedures and develops tools that are used by both the Engineering and Operations teams. As a Release Engineer you'll use your strong technical ability to drive product releases across many different systems and teams. You'll work hard to ensure that Facebook's products are delivered with a repeatable and scalable process.", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0IA0000006cQOOMA2"
                },
                {
                    "id": 20, 
                    "title": "Software Engineer, Infrastructure", 
                    "locationID": 6, 
                    "companyID": 4, 
                    "languageID": 1, 
                    "skillsetID": 3, 
                    "description": "Facebook is seeking an experienced Software Engineer to join our Infrastructure Engineering team in Boston. The position is full-time and is based in our Cambridge, MA office. There are minimal travel requirements for this position. Infrastructure Engineering builds large, distributed components that run Facebook. Our code serves millions of requests per second, and it does so with subsecond latency and in a fault tolerant manner. We handle everything from Facebook scale data storage, to synchronization and coordination of large server clusters, to providing a runtime environment for front end Facebook code. We are looking for candidates who share a passion for tackling complexity and building platforms that can scale through multiple orders of magnitude.", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0IA000000CxO6SMAV"
                },
                {
                    "id": 21, 
                    "title": "Full Stack Web Developer- Tools, WhatsApp", 
                    "locationID": 10, 
                    "companyID": 4, 
                    "languageID": 4, 
                    "skillsetID": 4, 
                    "description": "Full Stack Web Developer WhatsApp is the world’s largest and fastest growing communication company with over 600M Monthly active users globally. A Top 25 iOS app in more than 100 countries and an Android app with more than 500M installs on Google Play! Using your startup mindset and your experience developing native mobile apps, you will create new, awesome features used by 600+ Million current WhatsApp users. We are looking for Software Web Developer Downtown Mountain View, CA", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0IA000000G41MfMAJ"
                },
                {
                    "id": 22, 
                    "title": "Computer Vision Engineer, Oculus", 
                    "locationID": 10, 
                    "companyID": 4, 
                    "languageID": 2, 
                    "skillsetID": 3, 
                    "description": "Great virtual reality technology depends on advances in computer vision and tracking. As a computer vision engineer at Oculus, you'll be developing software for cutting edge vision applications that transform virtual reality from dream to reality. We're looking for a creative engineer to usher in the next era of human-computer interaction by integrating computer vision into everyday environments and practical products.", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0I1200000G4WSQEA3"
                },
                {
                    "id": 23, 
                    "title": "Data Analyst, Small & Medium Business", 
                    "locationID": 10, 
                    "companyID": 4, 
                    "languageID": 1, 
                    "skillsetID": 6, 
                    "description": "Facebook’s mission is to give people the power to share and make the world more open and connected. People use Facebook to stay connected with friends, family, & businesses, to discover what’s going on in the world, and to share and express what matters to them. The Small & Medium Business (SMB) team contributes directly to Facebook’s mission by connecting small businesses with their customers and helping them grow through solutions like pages and advertising. We succeed when we help our customers grow their business. The SMB team is seeking a data analyst who is passionate about using data and insights to drive business strategy, inform its execution, and improve efficiency. The analyst will focus on understanding the existing North America market and identifying future opportunities for growth. The ideal candidate is action-oriented and passionate about using data and analysis to evaluate success and inform efficiency in a fast-paced, dynamic environment. This is a full time position based in our Menlo Park HQ and will report to the Director of SMB North America.", 
                    "link": "https://www.facebook.com/careers/department?dept=data&req=a0I1200000G4VqJEAV"
                },
                {
                    "id": 24, 
                    "title": "Client Tools (WhatsApp) Intern", 
                    "locationID": 10, 
                    "companyID": 4, 
                    "languageID": 1, 
                    "skillsetID": 4, 
                    "description": "Client Tools - Intern Downtown Mountain View, CA WhatsApp is the world’s largest and fastest growing communications company with over 600M Monthly active users globally. A Top 25 iOS app in more than 100 countries and an Android app with more than 500M installs on Google Play! Using your startup mindset and your experience developing native mobile apps, you will create new, awesome features used by 600+ Million current WhatsApp users. We are looking for Mobile Software Developers for all our platforms: iOS, Android, Windows Phone, BlackBerry, and Nokia. We are seeking an intern to develop automations to capture screenshots from various WhatsApp applications to be published in our WhatsApp FAQ.", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0I1200000G4V9MEAV"
                },
                {
                    "id": 25, 
                    "title": "Research Scientist, Speech Recognition/Acoustic Modeling", 
                    "locationID": 10, 
                    "companyID": 4, 
                    "languageID": 4, 
                    "skillsetID": 5, 
                    "description": "Facebook is seeking a Speech Recognition Research Scientist to join our research team in Menlo Park. The ideal candidate will have research experience developing speech recognition systems in different languages. Individuals in this role should be experts in acoustic modeling, including discriminative training, neural networks, and machine learning, and have experience working on large quantities of data. The candidate will help Facebook conduct research that support naturally spoken input in more than 70 languages.", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0IA000000G2gDLMAZ"
                },
                {
                    "id": 26, 
                    "title": "Data Scientist, Infrastructure", 
                    "locationID": 10, 
                    "companyID": 4, 
                    "languageID": 4, 
                    "skillsetID": 6, 
                    "description": "How would Facebook scale to the next billion users? The Infrastructure Strategy group is responsible for the strategic analysis to support and enable the continued growth critical to Facebook’s infrastructure organization. The ideal candidate will be passionate about Facebook, highly analytical, have strong mathematical aptitude and has experience using data to drive cost effective decision making. This is a full-time position based in our headquarters in Menlo Park, CA.", 
                    "link": "https://www.facebook.com/careers/department?dept=infrastructure&req=a0I1200000G4W3PEAV"
                },
                {
                    "id": 27, 
                    "title": "Sustainability Analyst", 
                    "locationID": 10, 
                    "companyID": 4, 
                    "languageID": 4, 
                    "skillsetID": 6, 
                    "description": "Facebook is seeking an avid problem solver to join its infrastructure sustainability team to focus on data tracking and strategic analysis. The Sustainability Analyst will turn raw data into useful information, analyze operational impacts and contribute to strategic thinking about data impact and the projects it informs.", 
                    "link": "https://www.facebook.com/careers/department?dept=infrastructure&req=a0I1200000G4WS1EAN"
                },
                {
                    "id": 28, 
                    "title": "Data Platform Engineer", 
                    "locationID": 10, 
                    "companyID": 4, 
                    "languageID": 2, 
                    "skillsetID": 6, 
                    "description": "Do you like working with big data? Are you interested in working with some of the largest distributed distributed databases and data warehouses in the world? If yes, we want to talk to you. Facebook is seeking a Data Platform Engineer to join the Enterprise Data Infrastructure team to help our Facebook teams analyze multi-petabytes of data. You will help build and maintain solutions around the various Facebook distributed database technologies including HDFS/Hive, Presto, RocksDB, Scribe, and Vertica. The person should be creative and passionate about large scale, massively distributed, high performance distributed databases and data analysis tools. Their focus will enable the next generation of big data analysis platforms. This is a full time position at Facebook Menlo Park campus", 
                    "link": "https://www.facebook.com/careers/department?dept=it&req=a0IA000000G42VUMAZ"
                },
                {
                    "id": 29, 
                    "title": "MySQL Database Engineer", 
                    "locationID": 10, 
                    "companyID": 4, 
                    "languageID": 3, 
                    "skillsetID": 6, 
                    "description": "Facebook is seeking a MySQL Database Engineer. This position will be primarily responsible for managing and providing active support for all aspects of the Facebook MySQL data set while helping to facilitate its continuous evolution from today's best in class to that of tomorrow. Candidates should have extensive experience in writing efficient automation software and a visceral aversion to doing the same task twice. Some of the things we are working on can be seen at facebook.com/MySQLatFacebook.", 
                    "link": "https://www.facebook.com/careers/department?dept=engineering&req=a0IA000000CxfUlMAJ"
                },
                {
                    "id": 30, 
                    "title": "Software Engineer - Machine Learning/Relevance (Seattle)", 
                    "locationID": 2, 
                    "companyID": 5, 
                    "languageID": 2, 
                    "skillsetID": 3, 
                    "description": "You will work on cutting-edge problem and participate in the engineering life-cycle at Twitter, including designing distributed systems, writing production code, conducting code reviews and working alongside our infrastructure and reliability teams. You will be equally comfortable doing incremental quality work and also building brand new systems to enable future quality improvements. " ,                  
                    "link": "https://about.twitter.com/careers/positions?jvi=op86Xfwk,Job&s=Indeed"
                },
                {
                    "id": 31, 
                    "title": "Software Engineer - Systems (Seattle)", 
                    "locationID": 2, 
                    "companyID": 5, 
                    "languageID": 1, 
                    "skillsetID": 5, 
                    "description": "Our engineering teams are responsible for the services and infrastructure that connect hundreds of millions of active Twitter users to real-time information about what’s relevant in their lives and the world we live in. We work on some of the world’s largest distributed systems -- our core infrastructure receives hundreds of millions of tweets per day and serves tens of billions of API requests, all with an uptime in excess of 99.9%. Our other systems operate at a similarly staggering scale: we serve over 2+ billion search queries per day, render hundreds of millions of ad impressions, and process hundreds of terabytes of log and interaction data daily. As a software engineer at Twitter, you will help us build, scale and maintain these systems, all of which have a direct impact on the lives of our users and the success of our business. " ,                  
                    "link": "https://about.twitter.com/careers/positions?jvi=o5ViZfw1,Job&s=Indeed"
                },
                {
                    "id": 32, 
                    "title": "Software Engineer - Product (Seattle)", 
                    "locationID": 2, 
                    "companyID": 5, 
                    "languageID": 1, 
                    "skillsetID": 5, 
                    "description": "A Senior Developer ready to design and implement awesome new features through innovation and data-driven iterations at Twitter scale. Someone who wants to push limits of product innovation using the latest advancements in technology and methods - working closely with product managers, designers and other engineering teams. Someone that works best in an environment with a sense of urgency and can rapidly iterate on product/platform features." ,                  
                    "link": "https://about.twitter.com/careers/positions?jvi=om76Xfwg,Job&s=Indeed"
                },
                {
                    "id": 33, 
                    "title": "Software Engineer - Corporate Productivity", 
                    "locationID": 3, 
                    "companyID": 5, 
                    "languageID": 1, 
                    "skillsetID": 4, 
                    "description": "Brainstorm and implement products that improve the lives of all Twitter employees. Rapidly prototype new ideas with your teammates. Develop and maintain full stack web applications." ,                  
                    "link": "https://about.twitter.com/careers/positions?jvi=ozXTZfw8,Job&s=Indeed"
                },
                {
                    "id": 34, 
                    "title": "Software Engineer - Engineering Effectiveness", 
                    "locationID": 3, 
                    "companyID": 5, 
                    "languageID": 1, 
                    "skillsetID": 3, 
                    "description": "The Engineering Effectiveness team is empowered to build the engineering infrastructure, platform and tools to give Twitter this competitive edge. We design and develop the engineering infrastructure which is distributed, scalable, and enables fast iterations via continuous integration and reliable deployments.  Our contributions make Twitter Engineering an environment where developers thrive. This role will help shape Twitter’s future on tools, infrastructure and methodologies for the massive scale we are trying to achieve.  If you have empathy for developers, passion for engineering productivity, experience delivering scalable distributed systems - you will find this role liberating and challenging." ,           
                    "link": "https://about.twitter.com/careers/positions?jvi=oQCqXfwz,Job&s=Indeed"
                },
                {
                    "id": 35, 
                    "title": "IT Applications Engineer", 
                    "locationID": 3, 
                    "companyID": 5, 
                    "languageID": 4, 
                    "skillsetID": 3, 
                    "description": "To strengthen our growing team, we are looking for an experienced Salesforce Developer to design and build highly scalable business application solutions leveraging force.com, service cloud, sales cloud, and app exchange solutions. As an integral member of the IT business systems team, this position will be responsible for developing innovative solutions for business process automation. You will possess outstanding interpersonal skills and demonstrate yourself to be a great analytical thinker. You are team-oriented, and you thrive in a fast paced environment." ,           
                    "link": "https://about.twitter.com/careers/positions?jvi=oONQZfwa,Job&s=Indeed"
                },
                {
                    "id": 36, 
                    "title": "Software Engineer - Monetization", 
                    "locationID": 3, 
                    "companyID": 5, 
                    "languageID": 1, 
                    "skillsetID": 3, 
                    "description": "Twitter is looking for great engineers to design and build our next generation of revenue products. You will be joining a team that is making a huge impact on Twitter's business and providing an indispensable platform for marketers. We work in small teams and ship to production every day. We're driven by measurement and data to inform our decisions, learning about our users and their problems. Our culture emphasizes creative problem solving, fast iteration and execution. Join us in our mission to build the world’s highest-performing advertising platform that’s also delightful to Twitter users. " ,           
                    "link": "https://about.twitter.com/careers/positions?jvi=oHAqXfwo,Job&s=Indeed"
                },
                {
                    "id": 37, 
                    "title": "QA Engineer-Vine", 
                    "locationID": 5, 
                    "companyID": 5, 
                    "languageID": 1, 
                    "skillsetID": 2, 
                    "description": "Create automated test scripts for iOS, Android, and web. Work closely alongside the API, Infrastructure, and Mobile teams. Documenting test cases, bug reporting,test execution  and reporting test status. Assure resolution of issues by following through to the end of the testing process. Document and execute regression, functional, and integration tests. Ensure the best possible experience for the users of Vine" ,           
                    "link": "https://about.twitter.com/careers/positions?jvi=oJCF0fwK,Job&s=Indeed"
                },
                {
                    "id": 38, 
                    "title": "Software Engineer, Architecture (Twitter Cortex)", 
                    "locationID": 5, 
                    "companyID": 5, 
                    "languageID": 2, 
                    "skillsetID": 6, 
                    "description": "We are looking for a number of passionate, talented, entrepreneurial engineers to join the team in New York to help us build the foundations for our deep learning platform." ,           
                    "link": "https://about.twitter.com/careers/positions?jvi=ottA0fwg,Job&s=Indeed"
                },
                {
                    "id": 39, 
                    "title": "Software Engineer, Systems (Twitter Cortex)", 
                    "locationID": 5, 
                    "companyID": 5, 
                    "languageID": 1, 
                    "skillsetID": 5, 
                    "description": "Design, contribute and maintain efficient production code to an automated offline and online machine (deep) learning platform/service. Contribute to a mixed stack/full stack environment: the platform will include production backend code (scala), training jobs (lua, C, CUDA), web services and all the way to frontend code for live monitoring. Maintain a complex live system with production data dependencies, low-latency requirements. Work in a collaborative manner with team members in remote offices. Be awesome in developing JVM services (Scala, Java). Balance out your desire to ship code with your responsibility to get it right" ,
                    "link": "https://about.twitter.com/careers/positions?jvi=ontA0fwa,Job&s=Indeed"
                },
                {
                    "id": 40, 
                    "title": "Fabric Support Engineer", 
                    "locationID": 6, 
                    "companyID": 5, 
                    "languageID": 1, 
                    "skillsetID": 2, 
                    "description": "We’re looking for someone who shares our passion about cultivating and building an amazing user experience-- for all Fabric developers. Building relationships and maintaining the exceptional standard we have set as an organization is the focal point of the role. We pride ourselves that our ability to help our users is second to none." ,
                    "link": "https://about.twitter.com/careers/positions?jvi=o8pQZfw6,Job&s=Indeed"
                },
                {
                    "id": 41, 
                    "title": "Full Stack - Software Engineer (Boston)", 
                    "locationID": 6, 
                    "companyID": 5, 
                    "languageID": 1, 
                    "skillsetID": 4, 
                    "description": "You will build web applications for our users, partners, and team. Those applications can range from business-critical internal tools to the core architecture of Twitter.com and our mobile website, with opportunities to work with a variety of languages and technologies." ,
                    "link": "https://about.twitter.com/careers/positions?jvi=otBqXfwb,Job&s=Indeed"
                },
                {
                    "id": 42, 
                    "title": "Technical Consultant, Customer Success", 
                    "locationID": 5, 
                    "companyID": 6, 
                    "languageID": 1, 
                    "skillsetID": 4, 
                    "description": "Lead technical customer pre-sales discussions/engagements as they relate to integration solutions with the LinkedIn Talent Solutions platform. Own and manage customer engagements through the entire implementation, delivery and support lifecycle. Manage technical partner relationships and continue to build on top of existing integrations and processes. Partner with different internal cross functional groups to communicate/escalate customer technical issues, help drive/influence product roadmap decisions based on customer/partner feedback, and implement internal tools/solutions to help demonstrate product value propositions. Develop and deliver on-going internal sales training and education of Talent Solutions products and services. Contribute to the development and sharing of best practices. Establish yourself as a Subject Matter Expert. Develop and maintain centralized content for customers, partners, and internal teams." ,
                    "link": "http://www.ihispano.com/jobs/solutions-architect-technical-consulting?sk=1&id=8154e1e5666293a6af5a00116d&utm_source=Indeed&utm_medium=cpc&utm_campaign=Indeed&rx_campaign=Indeed08&rx_medium=cpc&rx_source=Indeed"
                },
                {
                    "id": 43, 
                    "title": "Engineering Intern", 
                    "locationID": 9, 
                    "companyID": 6, 
                    "languageID": 1, 
                    "skillsetID": 4, 
                    "description": "As an Engineering Intern, you will join our SlideShare team in building a great site and excellent software. You will use Ruby and Puppet extensively but if you aren’t familiar with these programs, no worries, we’ll teach you! You will be responsible for dozens of code deployments per day which means you will ship code WHENEVER your feature is ready. Be prepared to ship on day one!" ,
                    "link": "http://hire.jobvite.com/CompanyJobs/Careers.aspx?k=Job&c=q2XaVfwO&j=oInx0fwm&s=Indeed"
                },
                {
                    "id": 44, 
                    "title": "Principal Data Scientist, Consumer Analytics", 
                    "locationID": 9, 
                    "companyID": 6, 
                    "languageID": 4, 
                    "skillsetID": 5, 
                    "description": "The Consumer Analytics team at LinkedIn works in close partnership with the Product team to identify opportunity to develop and enhance products and features that connect our Members with greater professional opportunity. We are looking for a Senior/Principal Data Scientist to join our team in developing innovative new technologies, features and products that will help further our mission of connecting the world’s professionals. You will be responsible for informing strategy and decisions as well as building, measuring, understanding and improving products. Ultimately, you will develop data-driven product solutions that will add value to our customers and improve the professional lives of our members." ,
                    "link": "http://hire.jobvite.com/CompanyJobs/Careers.aspx?k=Job&c=qOW9Vfwy&j=ozHI0fwI&s=Indeed"
                },
                {
                    "id": 45, 
                    "title": "Product Innovation Intern", 
                    "locationID": 9, 
                    "companyID": 6, 
                    "languageID": 3, 
                    "skillsetID": 6, 
                    "description": "Our goal is to build career navigation products that meets this challenge.  Our data at Linkedin is an embarrassment of riches.  Leveraging this data allows us to create experiences that allow members to explore, discover, understand and act upon ambitions and goals.  Above all, we seek to shift the world towards “optimistic, determinate.”" ,
                    "link": "http://hire.jobvite.com/CompanyJobs/Careers.aspx?k=Job&c=qOW9Vfwy&j=o1Cq0fwN&s=Indeed"
                },
                {
                    "id": 46, 
                    "title": "Product Analytics Intern", 
                    "locationID": 9, 
                    "companyID": 6, 
                    "languageID": 1, 
                    "skillsetID": 6, 
                    "description": "The Business Analytics team is looking for data junkies who love turning data into gold and who want to make an impact. You will have the opportunity to help build data products and own analytics in the area of Mobile, Social Advertising, Engagement, etc. You will be working closely with monetization product managers and engineers to drive the business. LinkedIn's reputable internship program is known for plentiful activities and a fun Intern Hackathon. Join us this summer!" ,
                    "link": "http://hire.jobvite.com/CompanyJobs/Careers.aspx?k=Job&c=qOW9Vfwy&j=owDq0fwj&s=Indeed"
                },
                {
                    "id": 47, 
                    "title": "Data Scientist, Growth Analytics", 
                    "locationID": 9, 
                    "companyID": 6, 
                    "languageID": 1, 
                    "skillsetID": 6, 
                    "description": "LinkedIn member data is amazingly rich and provides a fantastic opportunity for Data Scientists to explore and create, ultimately developing ways for members to improve their professional lives. You’ll have the opportunity to work with some of the best data people anywhere in an environment which truly values data-driven decisions." ,
                    "link": "http://hire.jobvite.com/CompanyJobs/Careers.aspx?k=Job&c=qOW9Vfwy&j=oPRz0fwZ&s=Indeed"
                }

]
